app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "twitter_username", "postcode", "created_at") VALUES('2009-03-07 17:19:38', 'aubergene', 'TN1 2XJ', '2009-03-07 17:19:38')